# Day2_03 Pandas 将 DataFrame 数据转为一行

> 本文系参加《盖若 Python 训练营》的练习内容，训练营网址 https://www.gairuo.com/p/python-camp

源数据如下：

In [1]:
import pandas as pd

df = pd.DataFrame({
    'a': ['a1', 'a2', 'a3'],
    'b': [11, 22, 33],
    'c': [44, 55, 66]
})
df

    a   b   c
0  a1  11  44
1  a2  22  55
2  a3  33  66

我们需要将它转换一行，即以下形式：
```
    a   b   c   a   b   c   a   b   c
0  a1  11  44  a2  22  55  a3  33  66
```

------

为使得数据变为一行，最容易想到的方法就是转置，所以先尝试使用多级索引将数据全部放在一列上，然后再转置，最后去掉多级索引。

In [2]:
df1 = df.stack().to_frame()
df1

      0
0 a  a1
  b  11
  c  44
1 a  a2
  b  22
  c  55
2 a  a3
  b  33
  c  66

In [3]:
df1.T.droplevel(0,axis=1)

    a   b   c   a   b   c   a   b   c
0  a1  11  44  a2  22  55  a3  33  66

也可以交换操作顺序

In [4]:
df2 = df.stack().to_frame()
df2

      0
0 a  a1
  b  11
  c  44
1 a  a2
  b  22
  c  55
2 a  a3
  b  33
  c  66

In [5]:
df2.droplevel(0).T

    a   b   c   a   b   c   a   b   c
0  a1  11  44  a2  22  55  a3  33  66